# SQL Practice   
1. [Create Sample Tables](#1.-Create-Sample-Tables)
2. [Beginning Exercises](#2.-Beginning-Exercises)
3. [Answers: Beginning Exercises](#3.-Answers:-Beginning-Exercises)
4. [Intermediate Exercises](#4.-Intermediate-Exercises)
5. [Answers: Intermediate Exercises](#5.-Answers:-Intermediate-Exercises)

Adapted from: <a href=https://www.geeksforgeeks.org/sql/sql-exercises/>SQL Exercises : SQL Practice with Solution for Beginners and Experienced</a>, Last Accessed : 1 June, 2025.

In [ ]:
# To install SQLAlchemy module, uncomment 
# !pip install sqlalchemy

In [1]:
from sqlalchemy import create_engine, text
import pandas as pd

In [3]:
# Access Database
engine = create_engine('sqlite:///sample_database.db')

## 1. Create Sample Tables
### Warning: 
* Execute the commands in this section only once.
* After the tables have been created and data added, you will get an error if you try to execute them again.
* The tables can only be created one time, and duplicate data can't be added to the tables.

#### Create `Products` Table

In [5]:
create_products_table_query = """
CREATE TABLE Products (
    product_id INT PRIMARY KEY,
    product_name VARCHAR(100),
    category VARCHAR(50),
    unit_price DECIMAL(10, 2)
)
"""

with engine.connect() as conn:
    conn.execute(text(create_products_table_query))

#### Insert data into `Products` table

In [7]:
insert_products_query = """INSERT INTO Products (product_id, product_name, category, unit_price) VALUES
(101, 'Laptop', 'Electronics', 500.00),
(102, 'Smartphone', 'Electronics', 300.00),
(103, 'Headphones', 'Electronics', 30.00),
(104, 'Keyboard', 'Electronics', 20.00),
(105, 'Mouse', 'Electronics', 15.00),
(201, 'Chair', 'Furniture', 200.00),
(202, 'Desk', 'Furniture', 400.00)
"""

with engine.begin() as conn:  # .begin() ensures commit
    conn.execute(text(insert_products_query))

#### Create `Sales` table

In [9]:
create_sales_table_query = """
CREATE TABLE Sales (
    sale_id INT PRIMARY KEY,
    product_id INT,
    quantity_sold INT,
    sale_date DATE,
    total_price DECIMAL(10, 2),
    FOREIGN KEY (product_id) REFERENCES Products(product_id)
)
"""

with engine.connect() as conn:
    conn.execute(text(create_sales_table_query))

#### Insert sample data into `Sales` table

In [11]:
insert_sales_query = """INSERT INTO Sales (sale_id, product_id, quantity_sold, sale_date, total_price) VALUES
(1, 101, 5, '2024-01-01', 2500.00),
(2, 102, 3, '2024-01-02', 900.00),
(3, 103, 2, '2024-01-02', 60.00),
(4, 104, 4, '2024-01-03', 80.00),
(5, 105, 6, '2024-01-03', 90.00),
(6, 104, 2, '2024-01-04', 40.00),
(7, 105, 3, '2024-01-04', 45.00)
"""

with engine.begin() as conn:  # .begin() ensures commit
    conn.execute(text(insert_sales_query))

## 2. Beginning Exercises

In [15]:
def run_query(query):
    """ 
    Function using pandas to run SQL queries.
    """
    return pd.read_sql_query(query, engine)

#### **For example**: Retrieve all columns from the `Sales` table.
* Note that the queries need to be in the form of string and need to be enclosed with quotation marks.

In [ ]:
# Variable to hold query 
query = "SELECT * FROM Sales"

# Run query on database 
run_query(query)

#### 1. Retrieve the `product_name` and `unit_price` from the `Products` table.
* Try to answer fill in the query yourself. Set the `query` variable to a query in the form of a string.
* If you set stuck, all of the answers are in ***Section 3***.

In [ ]:
query = ""

run_query(query)

#### 2. Retrieve the `sale_id` and `sale_date` from the `Sales` table.

In [ ]:
query = ""

run_query(query)

#### 3. Filter the `Sales` table to show only sales with a `total_price` greater than $100.

In [ ]:
query = ""

run_query(query)

#### 4. Filter the `Products` table to show only products in the **Electronics** category.
* Because the values in the `category` column are strings, you'll have to nest strings in your query. To nest strings, you need to use one type of quotes for the outer quotes and another for the inner quotes. In other words, the outer quotes can be double quotes and your inner quotes can be single.
* For instance, "'Have a nice day,' he said."

In [ ]:
query = ""

run_query(query)

#### 5. Retrieve the `sale_id` and `total_price` from the `Sales` table for sales made on January 3, 2024.
* To make queries more readable, we often break queries into multi-lines. To create multi-line strings, we use triple quotes.
* For instance, <br>
*"""SELECT total_bill, tip, sex* <br>
                   *FROM tips* <br>
                   *WHERE time='Dinner'* <br>
                """
* Because the dates are stored like strings, you'll need to nest your strings again for this query. Also be sure the date in your query is in the correct format.

In [ ]:
query = """

"""

run_query(query)

#### 6. Retrieve the `product_id` and `product_name` from the `Products` table for products with a `unit_price` greater than $100.

In [ ]:
query = """

"""

run_query(query)

#### 7. Calculate the total revenue generated from all sales in the `Sales` table.
* By default, this query will return a column with an uninformative label. Instead, display the results with a column labeled `total_revenue`.
* To so this, you may want to use the keyword `AS` in your query.

In [ ]:
query = """

"""

run_query(query)

#### 8. Calculate the average `unit_price` of products in the `Products` table.
* Label the returned column `average_unit_price`.

In [ ]:
query = """

"""

run_query(query)

#### 9. Calculate the total `quantity_sold` from the Sales table.
* Give the column an appropriate label.

In [ ]:
query = """

"""

run_query(query)

#### 10. Count Sales Per Day from the `Sales` table
* The returned table should include two columns: one with the date and one with the count.
* You should give the count column an appropriate label, and the results should be sorted by the date.

In [ ]:
query = """

"""

run_query(query)

#### 11. Retrieve `product_name` and `unit_price` from the `Products` table with the Highest Unit Price
* There are many ways to return this result, but you may want to try using the `ORDER BY` and `LIMIT` commands.

In [ ]:
query = """

"""

run_query(query)

#### 12. Retrieve the `sale_id`, `product_id`, and `total_price` from the `Sales` table for sales with a `quantity_sold` greater than 4.

In [ ]:
query = """

"""

run_query(query)

#### 13. Retrieve the `product_name` and `unit_price` from the `Products` table, ordering the results by `unit_price` in descending order.

In [ ]:
query = """

"""

run_query(query)

#### 14. Retrieve the `total_price` of all sales, rounding the values to two decimal places.

In [ ]:
query = """

"""

run_query(query)

#### 15. Calculate the average `total_price` of sales in the `Sales` table.
* Be sure to label the column with an appropriate name.

In [ ]:
query = """

"""

run_query(query)

#### 16. Calculate the total revenue generated from sales of products in the **Electronics** category.
* Be sure to give the column an appropriate label.

In [ ]:
query = """

"""

run_query(query)

#### 17. Retrieve the `product_name` and `unit_price` from the `Products` table, filtering the `unit_price` to show only values between \\$20 and \\$600.

In [ ]:
query = """

"""

run_query(query)

#### 18. Retrieve the `product_name` and `category` from the `Product`s table, ordering the results by `category` in ascending order.

In [ ]:
query = """

"""

run_query(query)

## 3. Answers: Beginning Exercises

#### 1. Retrieve the `product_name` and `unit_price` from the `Products` table.

In [17]:
query = "SELECT product_name, unit_price FROM Products"

run_query(query)

  product_name  unit_price
0       Laptop         500
1   Smartphone         300
2   Headphones          30
3     Keyboard          20
4        Mouse          15
5        Chair         200
6         Desk         400

#### 2. Retrieve the `sale_id` and `sale_date` from the `Sales` table.

In [19]:
query = "SELECT sale_id, sale_date FROM Sales"

run_query(query)

   sale_id   sale_date
0        1  2024-01-01
1        2  2024-01-02
2        3  2024-01-02
3        4  2024-01-03
4        5  2024-01-03
5        6  2024-01-04
6        7  2024-01-04

#### 3. Filter the `Sales` table to show only sales with a `total_price` greater than $100.

In [21]:
query = "SELECT * FROM Sales WHERE total_price > 100"

run_query(query)

   sale_id  product_id  quantity_sold   sale_date  total_price
0        1         101              5  2024-01-01         2500
1        2         102              3  2024-01-02          900

#### 4. Filter the `Products` table to show only products in the **Electronics** category.

In [23]:
query = "SELECT * FROM Products WHERE category = 'Electronics'"

run_query(query)

   product_id product_name     category  unit_price
0         101       Laptop  Electronics         500
1         102   Smartphone  Electronics         300
2         103   Headphones  Electronics          30
3         104     Keyboard  Electronics          20
4         105        Mouse  Electronics          15

#### 5. Retrieve the `sale_id` and `total_price` from the `Sales` table for sales made on January 3, 2024.

In [25]:
query = """SELECT sale_id, total_price 
FROM Sales 
WHERE sale_date = '2024-01-03'
"""

run_query(query)

   sale_id  total_price
0        4           80
1        5           90

#### 6. Retrieve the `product_id` and `product_name` from the `Products` table for products with a `unit_price` greater than $100.

In [27]:
query = """SELECT product_id, product_name 
FROM Products 
WHERE unit_price > 100
"""

run_query(query)

   product_id product_name
0         101       Laptop
1         102   Smartphone
2         201        Chair
3         202         Desk

#### 7. Calculate the total revenue generated from all sales in the `Sales` table.

In [29]:
query = """SELECT SUM(total_price) AS total_revenue 
FROM Sales
"""

run_query(query)

   total_revenue
0           3715

#### 8. Calculate the average `unit_price` of products in the `Products` table.

In [31]:
query = """SELECT AVG(unit_price) AS average_unit_price 
FROM Products
"""

run_query(query)

   average_unit_price
0          209.285714

#### 9. Calculate the total `quantity_sold` from the Sales table.

In [33]:
query = """SELECT SUM(quantity_sold) AS total_quantity_sold 
FROM Sales
"""

run_query(query)

   total_quantity_sold
0                   25

#### 10. Count Sales Per Day from the `Sales` table

In [35]:
query = """SELECT sale_date, COUNT(*) AS sales_count 
FROM Sales 
GROUP BY sale_date 
ORDER BY sale_date
"""

run_query(query)

    sale_date  sales_count
0  2024-01-01            1
1  2024-01-02            2
2  2024-01-03            2
3  2024-01-04            2

#### 11. Retrieve `product_name` and `unit_price` from the `Products` table with the Highest Unit Price

In [37]:
query = """SELECT product_name, unit_price 
FROM Products 
ORDER BY unit_price DESC 
LIMIT 1
"""

run_query(query)

  product_name  unit_price
0       Laptop         500

#### 12. Retrieve the `sale_id`, `product_id`, and `total_price` from the `Sales` table for sales with a `quantity_sold` greater than 4.

In [39]:
query = """SELECT sale_id, product_id, total_price 
FROM Sales 
WHERE quantity_sold > 4
"""

run_query(query)

   sale_id  product_id  total_price
0        1         101         2500
1        5         105           90

#### 13. Retrieve the `product_name` and `unit_price` from the `Products` table, ordering the results by `unit_price` in descending order.

In [41]:
query = """SELECT product_name, unit_price 
FROM Products 
ORDER BY unit_price DESC
"""

run_query(query)

  product_name  unit_price
0       Laptop         500
1         Desk         400
2   Smartphone         300
3        Chair         200
4   Headphones          30
5     Keyboard          20
6        Mouse          15

#### 14. Retrieve the `total_price` of all sales, rounding the values to two decimal places.

In [43]:
query = """SELECT ROUND(SUM(total_price), 2) AS total_sales 
FROM Sales
"""

run_query(query)

   total_sales
0       3715.0

#### 15. Calculate the average `total_price` of sales in the `Sales` table.

In [45]:
query = """SELECT AVG(total_price) AS average_total_price 
FROM Sales
"""

run_query(query)

   average_total_price
0           530.714286

#### 16. Calculate the total revenue generated from sales of products in the 'Electronics' category.

In [47]:
query = """SELECT SUM(Sales.total_price) AS total_revenue 
FROM Sales 
JOIN Products ON Sales.product_id = Products.product_id 
WHERE Products.category = 'Electronics'
"""

run_query(query)

   total_revenue
0           3715

#### 17. Retrieve the `product_name` and `unit_price` from the `Products` table, filtering the `unit_price` to show only values between \\$20 and \\$600.

In [49]:
query = """SELECT product_name, unit_price 
FROM Products 
WHERE unit_price BETWEEN 20 AND 600
"""

run_query(query)

  product_name  unit_price
0       Laptop         500
1   Smartphone         300
2   Headphones          30
3     Keyboard          20
4        Chair         200
5         Desk         400

#### 18. Retrieve the `product_name` and `category` from the `Product`s table, ordering the results by `category` in ascending order.

In [51]:
query = """SELECT product_name, category 
FROM Products 
ORDER BY category ASC
"""

run_query(query)

  product_name     category
0       Laptop  Electronics
1   Smartphone  Electronics
2   Headphones  Electronics
3     Keyboard  Electronics
4        Mouse  Electronics
5        Chair    Furniture
6         Desk    Furniture

## 4. Intermediate Exercises
* These queries are more challenging and may require you to research other SQL commands and clauses.  
* Be sure to include descriptive column headers for results of aggregate functions.

#### 1. Calculate the total `quantity_sold` of products in the **Electronics** category.

In [ ]:
query = """

"""

run_query(query)

#### 2. Retrieve `sale_id`, `product_name` and `total_price` from the `Sales` table, calculating the `total_price` as `quantity_sold` multiplied by `unit_price` for each sale.

In [ ]:
query = """

"""

run_query(query)

#### 3. Identify the Most Frequently Sold Product from `Sales` table.
* Be sure to include the product id and number of products sold.

In [ ]:
query = """

"""

run_query(query)

#### 4. Find the Products Not Sold from `Products` table.

In [ ]:
query = """

"""

run_query(query)

#### 5. Calculate the total revenue generated from sales for each product category.
* To shorten the query, you may want to use aliases for the tables.

In [ ]:
query = """

"""

run_query(query)

#### 6. Find the product category with the highest average unit price.

In [ ]:
query = """

"""

run_query(query)

#### 7. Identify products with total sales exceeding \\$30.
* For this query, you may want to use the `HAVING` clause.
* You may also want to use table aliases here and for any of the following queries that are too long.

In [ ]:
query = """

"""

run_query(query)

#### 8. Retrieve Sales Details for Products with *'Smart'* in Their Name.
* The `LIKE` clause is used to identify strings that contain specific sub-strings.

In [ ]:
query = """

"""

run_query(query)

#### 9. Determine the average quantity sold for products with a unit price greater than \\$100.

In [ ]:
query = """

"""

run_query(query)

#### 10. Retrieve the product name and total sales revenue for each product.
* Sort the products in ascending order by their total revenue.

In [ ]:
query = """

"""

run_query(query)

#### 11. List all sales along with the corresponding product names.

In [ ]:
query = """

"""

run_query(query)

#### 12. Retrieve sales revenue by product category and return the top 3 categories contributing the most to total revenue.

In [ ]:
query = """

"""

run_query(query)

#### 13. Rank products based on total sales revenue.

In [ ]:
query = """

"""

run_query(query)

#### 14. Categorize sales as "High", "Medium", or "Low" based on total price. 
* High: total price $\ge$ \\$200 
* Medium: \\$100 $\le$ total price $\lt$ \\$200
* Low: total price $\lt$ \\$100

In [ ]:
query = """

"""

run_query(query)

#### 15. Identify sales where the quantity sold is greater than the average quantity sold.

In [ ]:
query = """

"""

run_query(query)

#### 16. Retrieve the product details (name, category, unit price) for products that have a quantity sold greater than the average quantity sold across all products.

In [ ]:
query = """

"""

run_query(query)

#### 17. Create a query that lists the product names along with their corresponding sales count.

In [ ]:
query = """

"""

run_query(query)

#### 18. Write a query to find all sales where the total price is greater than the average total price of all sales.

In [ ]:
query = """

"""

run_query(query)

## 5. Answers: Intermediate Exercises

#### 1. Calculate the total `quantity_sold` of products in the **Electronics** category.

In [53]:
query = """SELECT SUM(quantity_sold) AS total_quantity_sold 
FROM Sales 
JOIN Products ON Sales.product_id = Products.product_id 
WHERE Products.category = 'Electronics'
"""

run_query(query)

   total_quantity_sold
0                   25

#### 2. Retrieve `sale_id`, `product_name` and `total_price` from the `Sales` table, calculating the `total_price` as `quantity_sold` multiplied by `unit_price` for each sale.

In [57]:
query = """SELECT sale_id, product_name, quantity_sold * unit_price AS total_price 
FROM Sales 
JOIN Products ON Sales.product_id = Products.product_id
"""

run_query(query)

   sale_id product_name  total_price
0        1       Laptop         2500
1        2   Smartphone          900
2        3   Headphones           60
3        4     Keyboard           80
4        5        Mouse           90
5        6     Keyboard           40
6        7        Mouse           45

#### 3. Identify the Most Frequently Sold Product from `Sales` table.
* Be sure to include the product id and number of products sold.

In [67]:
query = """SELECT product_id, COUNT(*) AS sales_count 
FROM Sales 
GROUP BY product_id 
ORDER BY sales_count DESC 
LIMIT 1
"""

run_query(query)

   product_id  sales_count
0         105            2

#### 4. Find the Products Not Sold from `Products` table.

In [69]:
query = """SELECT product_id, product_name 
FROM Products 
WHERE product_id NOT IN (SELECT DISTINCT product_id FROM Sales)
"""

run_query(query)

   product_id product_name
0         201        Chair
1         202         Desk

#### 5. Calculate the total revenue generated from sales for each product category.
* To shorten the query, you may want to use aliases for the tables.

In [71]:
query = """SELECT p.category, SUM(s.total_price) AS total_revenue
FROM Sales AS s
JOIN Products AS p ON s.product_id = p.product_id
GROUP BY p.category
"""

run_query(query)

      category  total_revenue
0  Electronics           3715

#### 6. Find the product category with the highest average unit price.

In [73]:
query = """SELECT category
FROM Products
GROUP BY category
ORDER BY AVG(unit_price) DESC
LIMIT 1
"""

run_query(query)

    category
0  Furniture

#### 7. Identify products with total sales exceeding \\$30.
* For this query, you may want to use the `HAVING` clause.
* You may also want to use table aliases here and for any of the following queries that are too long.

In [75]:
query = """SELECT p.product_name
FROM Sales AS s
JOIN Products AS p ON s.product_id = p.product_id
GROUP BY p.product_name
HAVING SUM(s.total_price) > 30
"""

run_query(query)

  product_name
0   Headphones
1     Keyboard
2       Laptop
3        Mouse
4   Smartphone

#### 8. Retrieve Sales Details for Products with *'Smart'* in Their Name.
* The `LIKE` clause is used to identify strings that contain specific sub-strings.

In [77]:
query = """SELECT s.sale_id, p.product_name, s.total_price 
FROM Sales AS s 
JOIN Products AS p ON s.product_id = p.product_id 
WHERE p.product_name LIKE '%Smart%'
"""

run_query(query)

   sale_id product_name  total_price
0        2   Smartphone          900

#### 9. Determine the average quantity sold for products with a unit price greater than \\$100.

In [79]:
query = """SELECT AVG(s.quantity_sold) AS average_quantity_sold
FROM Sales AS s
JOIN Products AS p ON s.product_id = p.product_id
WHERE p.unit_price > 100
"""

run_query(query)

   average_quantity_sold
0                    4.0

#### 10. Retrieve the product name and total sales revenue for each product.
* Sort the products in ascending order by their total revenue.

In [81]:
query = """SELECT p.product_name, SUM(s.total_price) AS total_revenue
FROM Sales AS s
JOIN Products AS p ON s.product_id = p.product_id
GROUP BY p.product_name
ORDER BY total_revenue
"""

run_query(query)

  product_name  total_revenue
0   Headphones             60
1     Keyboard            120
2        Mouse            135
3   Smartphone            900
4       Laptop           2500

#### 11. List all sales along with the corresponding product names.

In [83]:
query = """SELECT s.sale_id, p.product_name
FROM Sales AS s
JOIN Products AS p ON s.product_id = p.product_id
"""

run_query(query)

   sale_id product_name
0        1       Laptop
1        2   Smartphone
2        3   Headphones
3        4     Keyboard
4        5        Mouse
5        6     Keyboard
6        7        Mouse

#### 12. Retrieve sales revenue by product category and return the top 3 categories contributing the most to total revenue.

In [85]:
query = """SELECT p.category, 
       SUM(s.total_price) AS category_revenue,
       (SUM(s.total_price) / (SELECT SUM(total_price) FROM Sales)) * 100 AS revenue_percentage
FROM Sales AS s
JOIN Products AS p ON s.product_id = p.product_id
GROUP BY p.category
ORDER BY revenue_percentage DESC
LIMIT 3
"""

run_query(query)

      category  category_revenue  revenue_percentage
0  Electronics              3715                 100

#### 13. Rank products based on total sales revenue.

In [87]:
query = """SELECT p.product_name, SUM(s.total_price) AS total_revenue,
       RANK() OVER (ORDER BY SUM(s.total_price) DESC) AS revenue_rank
FROM Sales AS s
JOIN Products AS p ON s.product_id = p.product_id
GROUP BY p.product_name
"""

run_query(query)

  product_name  total_revenue  revenue_rank
0       Laptop           2500             1
1   Smartphone            900             2
2        Mouse            135             3
3     Keyboard            120             4
4   Headphones             60             5

#### 14. Categorize sales as "High", "Medium", or "Low" based on total price. 
* High: total price $\ge$ \\$200 
* Medium: \\$100 $\le$ total price $\lt$ \\$200
* Low: total price $\lt$ \\$100

In [94]:
query = """SELECT sale_id, 
       CASE 
           WHEN total_price > 200 THEN 'High'
           WHEN total_price BETWEEN 100 AND 200 THEN 'Medium'
           ELSE 'Low'
       END AS sales_category
FROM Sales
"""

run_query(query)

   sale_id sales_category
0        1           High
1        2           High
2        3            Low
3        4            Low
4        5            Low
5        6            Low
6        7            Low

#### 15. Identify sales where the quantity sold is greater than the average quantity sold.

In [97]:
query = """SELECT *
FROM Sales
WHERE quantity_sold > (SELECT AVG(quantity_sold) FROM Sales)
"""

run_query(query)

   sale_id  product_id  quantity_sold   sale_date  total_price
0        1         101              5  2024-01-01         2500
1        4         104              4  2024-01-03           80
2        5         105              6  2024-01-03           90

#### 16. Retrieve the product details (name, category, unit price) for products that have a quantity sold greater than the average quantity sold across all products.

In [100]:
query = """SELECT product_name, category, unit_price
FROM Products
WHERE product_id IN (
    SELECT product_id
    FROM Sales
    GROUP BY product_id
    HAVING SUM(quantity_sold) > (SELECT AVG(quantity_sold) FROM Sales)
)
"""

run_query(query)

  product_name     category  unit_price
0       Laptop  Electronics         500
1     Keyboard  Electronics          20
2        Mouse  Electronics          15

#### 17. Create a query that lists the product names along with their corresponding sales count.

In [103]:
query = """SELECT p.product_name, COUNT(s.sale_id) AS sales_count
FROM Products AS p
LEFT JOIN Sales AS s ON p.product_id = s.product_id
GROUP BY p.product_name
"""

run_query(query)

  product_name  sales_count
0        Chair            0
1         Desk            0
2   Headphones            1
3     Keyboard            2
4       Laptop            1
5        Mouse            2
6   Smartphone            1

#### 18. Write a query to find all sales where the total price is greater than the average total price of all sales.

In [106]:
query = """SELECT *
FROM Sales
WHERE total_price > (SELECT AVG(total_price) FROM Sales)
"""

run_query(query)

   sale_id  product_id  quantity_sold   sale_date  total_price
0        1         101              5  2024-01-01         2500
1        2         102              3  2024-01-02          900